app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-02-25 18:50:54.034651"], ["updated_at", "2019-02-25 18:50:54.034651"]]
---
  def create
    @student = Student.create(params.require(:student))